[
    {
        "link": "https://www.cbsnews.com/philadelphia/news/small-plane-crash-northeast-philadelphia-neighborhood-homes-catch-fire/",
        "Provider": "CBS",
        "headline": "Plane crash in Philadelphia neighborhood kills 7; several homes catch fire - CBS Philadelphia",
        "content": "Watch CBS News\nByJessica MacAulay,Joe Brandt,Frederick Sinclair,Taleisha Newbill,Ben Payne\nUpdated on:  February 1, 2025 / 5:52 PM EST/ CBS Philadelphia\nSix passengers of a medical jet and one person on the ground were killed after the plane crashed in a Philadelphia neighborhood on Friday evening, officials said.\nHospitals in the city report at least 20 victims have been treated for injuries from the crash, which caused an explosion and set several homes ablaze near the Roosevelt Mall in the area of Roosevelt Boulevard and Cottman Avenue.\nThe small plane, a Learjet 55, had just departed Northeast Philadelphia Airport bound for Springfield, Missouri, when it went down, according to a statement from the Federal Aviation Administration.\nMexican President Claudia Sheinbaum confirmed all six people aboard  — all of whom were Mexican citizens — were killed.\n\"I mourn the passing of six Mexicans in the aviation accident in Philadelphia, United States. Consular authorities are in constant contact with the families; I've asked the Foreign Affairs Secretary to support whatever is needed. My solidarity with their loved ones and friends,\" she said in a statement written in Spanish.\nIn a news conference Saturday morning, Philadelphia Mayor Cherelle Parker said one person in a car was killed on the ground. She warned that the total count of injuries may change as investigators continue working at the scene and tracking down who has been transported to hospitals.\nThe plane crashed into a neighborhood near the Roosevelt Mall just moments after leaving the airstrip at approximately 6:07 p.m. The first emergency calls went out about five minutes later, at 6:12 p.m.\nThe pediatric patient was a girl from Mexico who had received treatment at Shriners Children's Hospital Philadelphia, according to Mel Bower, a spokesperson for the hospital. Her treatment had ended and she was on her way home when the plane crashed.\nParker said the people aboard included the girl, her mother and four crew members.\nThe aircraft was operated by Jet Rescue Air Ambulance, aMexico-based company with divisions in Floridathat specializes in flights to Mexico, South America and the Caribbean.\n\"It's extremely hard and extremely difficult, those that were involved directly in her care were very aware that she was going to be traveling home and there had actually been a sendoff for her today,\" Bower said.\nHe said the hospital community at Shriners was impacted very deeply by this and that their patients are their family. Bower said the care the hospital provides is not just in the clinical sphere but goes beyond to a personal level.\nWhen asked if she enjoyed the end-of-treatment celebration earlier Friday, Bower said, \"I'm certain that she did. Our staff – they work so hard at bringing joy and laughter and excitement into all parts of the clinical aspect. Our patients don't look at it as going to the hospital. They go to a place where they have fun and have enjoyment.\"\nBower said the two doctors on the plane were not affiliated with Shriners, but rather the Jet Rescue Air Ambulance.\nShriners Children's Hospital has provided unique medical care and hope to children for over 100 years,according to its website.\nLocal hospitals tell CBS News Philadelphia they have treated more than 20 victims who were injured in the plane crash.\nA Temple University Health spokesperson said six people were taken to Temple University Hospital's Jeanes Campus, about two miles from the crash scene. As of Saturday afternoon, five patients had been treated and released from Jeanes.\nA sixth patient was transferred to Temple University Hospital, where they remain hospitalized in fair condition, the spokesperson said.\nJefferson Health provided care for 15 individuals – twelve have since been discharged; two have been admitted for further care and one patient was transferred to another unspecified hospital, a spokesperson said.\nSt. Christopher's Hospital for Children confirmed they were treating one pediatric patient.\nThe City of Philadelphia Office of Emergency Management has a list of resources for residents affected. In asocial post, they said to Text RECOVERPHL to 888-777 to get the latest updates and information.\nSaturday evening, NTSB officials gave preliminary insight into what they've learned about the crash since Friday night. The medical jet departed from a base in Florida Friday at around 12 p.m. and arrived in Northeast Philadelphia around 2:15 p.m. The jet was on the ground for a few hours and then departed the runway to go to Springfield, Missouri, at around 6:06 p.m.\nA GPS collected data that the jet climbed about 1,500 feet into the air before taking a slight right turn followed by a slight left turn before a steep descent where the plane crashed, officials said.\nThe entire flight was less than one minute.\nOfficials stressed they're still looking for the cockpit voice recorder and that it could be intact, but likely is damaged and could be fragmented.\nAnyone who comes across debris is asked to not touch it, but to emailwitness@ntsb.gov.\nThe agency is identifying the crash as an accident.\nInvestigators are combing through a debris field that extends across four to six city blocks, Philadelphia's Managing Director Adam Thiel said in a news briefing on Saturday morning.\n\"We also have debris in a remote area where something happened with the aircraft, and that's something that well have to leave the NTSB to talk about, Thiel said.\nIt's also possible that debris from the plane fell in other areas.\n\"It's possible that if you are somewhere not even near here...between this location and Northeast Airport, you may go out and find something in your yard, something on your car,\" Thiel added. \"Don't touch it, call 911. We need to know that.\"\nInvestigative teams were making another sweep of the neighborhood Saturday, going door-to-door and checking with residents of each home that may have been impacted. Inspectors from the city's Department of Licenses and Inspections will be onhand for homes in the area to have damage inspected, Thiel said.\nThat sweep is \"so we can be sure that we don't have other hidden damage or structural damage, and it is possible that we will still find that,\" Thiel said.\nPECO, the local energy company, said it shut off power for some customers in the area to ensure the safety of first responders on the scene. Residents were continuing to get their electricity back Saturday, PECO said.\nThe FAA and National Transportation Safety Board are investigating the crash. The NTSB will lead the investigation.\n\"So sad to see the plane go down in Philadelphia, Pennsylvania,\" President Trump said in a social media post. \"More innocent souls lost. Our people are totally engaged. First Responders are already being given credit for doing a great job. More to follow. God Bless you all.\"\nPhiladelphia City Councilmember Mike Driscoll described the plane crash as an \"active emergency response situation\" with \"reported mass casualties.\"\nState Rep. Jared Solomon, who represents Northeast Philadelphia, said he saw hundreds of first responders working to help out the community in the face of danger.\n\"In a time of profound tragedy, I was inspired to witness hundreds of our first responders sprinting towards danger to ensure the safety of our neighborhood. Northeast Philadelphia stands united in prayer for the families of the victims, and in gratitude for the brave firefighters and police officers who keep us safe,\" Solomon said.\nIn a news conference Friday night, Parker said several homes and vehicles were impacted. Residents were cautioned to stay out of the area.\n\"We're urging you to please stay away from the scene. If you see debris, call 911. Don't touch anything. This is still an active scene under investigation,\" Parker said.\nSaturday morning, the scene was full of investigators from the FAA, NTSB, Pennsylvania State Police and other agencies.\n\"We're just asking for prayers for any and everyone who may have been affected,\" Parker added.\nMultiple homes caught fire in the area of Cottman Avenue and Roosevelt Boulevard following the crash, fire officials said. The area of the crash is a densely populated residential neighborhood packed with rows of rowhomes.\nPolice sources told CBS News Philadelphia's Chief Investigative Reporter Joe Holden that parts of the plane hit cars in the area. Some businesses near the Roosevelt Mall were also on fire, sources said.\nDoorbell camera video from one home in the areacaptured the moment the jet crashed.\nPhiladelphia Office of Emergency Managementshared a photo of the scene in Northeast Philadelphia. Officials said roads are closed in the area including parts of Roosevelt Boulevard. Residents and motorists are asked to avoid the area as several authorities respond.\nPhiladelphia OEM saiddrivers should expect the extended closureof Cottman Avenue between Roosevelt Boulevard and Bustleton Avenue and the outer southbound lanes of Roosevelt Boulevard as they continue to respond to the scene.\nNeighbors in the areareported that their homes shook when the plane went down.\n\"I saw blinking lights coming from the sky. And I just saw them going down,\" said a 10-year-old boy on his way home from hockey practice. \"It was really scary.\"\nJimmy Weis was driving in the area when the plane went down.\n\"I just was driving and I saw a lot of police activity and then people texting me. I was close here and that there was a plane crash,\" Weis said. \"And my daughter who GPS'd me, freaked, called me and was making sure that I was OK.\"\nA man who lives nearby said he was inside his house talking to his brother when the plane crashed.\n\"I don't want to say it was like an earthquake, but it was like someone knocking on the door really hard,\" he said.\nHe said that was the moment when he and his brother ran out of their house to see what he described as chaotic as neighbors ran towards the crash.\nRed Cross Philadelphia and the School District of Philadelphiaopened a shelter for anyone needing housing or support at Samuel Fels High School located at 5500 Langdon Street.\n\"The mayor preaches about 'one Philly,'\" Pennsylvania Gov. Josh Shapiro said in a news briefing alongside Parker Friday. \"She talks about a unified approach to governing every day. What you're seeing here is a unified response to an awful aviation disaster. For as awful as that aviation disaster was, tonight we also saw the best of Philly. We saw neighbor helping neighbor. We saw Pennsylvanians looking out for one another.\"\n\"We know that there will be loss in this region and we want to offer our thoughts and our serious prayers for those who are grieving at this moment,\" Shapiro said.\nThe Northeast Philadelphia Airport was temporarily closed after the crash occurred. The airport has since reopened, a spokesperson for the Philadelphia Department of Aviation said.\nJessica MacAulay is a digital producer for CBSPhiladelphia.com. Jessica started out her career in broadcast journalism originally as an intern for CBS Philadelphia. She covers breaking news, local community and crime stories.\n© 2025 CBS Broadcasting Inc. All Rights Reserved.\n©2025 CBS Broadcasting Inc. All Rights Reserved."
    },
    {
        "link": "https://www.bbc.com/news/articles/ckg0m5n8g0do#:~:text=A%20small%20medical%20transport%20plane,ground%2C%20the%20mayor%20has%20confirmed.",
        "Provider": "BBC",
        "headline": "Mother and child among seven killed in Philadelphia medical jet crash",
        "content": "A small medical transport plane crashed into several buildings in the US city of Philadelphia on Friday evening, killing all six people on board and at least one other person on the ground, the mayor has confirmed.\nThe jet was on a medical transport trip, heading to Tijuana, Mexico, with a short stop-over in Missouri. It was carrying a child patient and her mother, along with two pilots, a doctor and paramedic. They were all Mexican nationals.\nBut just one minute after take-off, the Learjet 55 plummeted to the ground. Videos show the plane coming down quickly and sparking a huge fireball.\nNineteen others were injured, though Mayor Cherelle Parker said that number could still change.\nSpeaking at a news conference on Saturday, Philadelphia city managing director Adam Thiel said it would probably be \"days or more\" until officials are able to confirm \"the number of folks who perished in this tragedy and the outcome of those who were injured\".\nHe added that there is still \"a lot of unknowns about who was where\" when the crash happened.\nThe girl being transported to Mexico had just finished medical treatment for a life-threatening illness at Shriners Children's Hospital in Philadelphia.\nEarlier on Friday, staff had thrown her a party to celebrate, hospital spokesman Mel Bower said. He added that staff who treated her had been \"impacted very deeply\" by news of the tragedy.\nThe flight was bound for Springfield, Missouri for a short stop-over, before continuing onto Tijuana.\nThe plane left Northeast Philadelphia Airport at about 18:07 local time (23:07 GMT) on Friday, rose to 1,500ft, turned slightly right, then slightly left, then began a steep descent, National Transportation Safety Board (NTSB) officials said.\nThe crash occurred less than four miles (6.4km) away. Flight logs show the plane was in the air \"for only a minute\" before it crashed, Mayor Parker said.\nNo issues were reported from the plane to air traffic control, and controllers who attempted to get a response from the flight crew did not receive one, NTSB chair Jennifer Homendy said.\nWitnesses described shrapnel damaging cars and sending burning debris into the streets. Photos of the aftermath show mangled, burnt-out vehicles and a deep gouge in the street.\nFire officials said there were five separate fires sparked by the crash, but they were contained and extinguished.\nThe crash happened just blocks from the Roosevelt Mall, a three-storey shopping centre in a densely populated part of Philadelphia, the fifth biggest city in the US.\nThe area is filled with terraced housing and shops. Many properties lost power after the crash.\nOne man said he was driving when he heard a whirring sound and then a loud explosion.\n\"Everyone just started screaming,\" he said.\nAnother witness told local media the explosion \"lit up the whole sky\".\n\"I just saw a plane basically hit the building and it exploded. The sky lit up and I pulled over and basically, it was just real bad around here,\" the witnesstold WPVI-TV, describing the crash as feeling like an earthquake.\nRyan Tian, 23, toldthe Philadelphia Inquirerhe was getting dinner when he saw a \"massive fireball\" that turned the sky orange.\n\"I thought we were getting attacked by something,\" he said.\nIn a statement, Jared Solomon, a local state representative, said: \"In a time of profound tragedy, I was inspired to witness hundreds of our first responders sprinting towards danger to ensure the safety of our neighbourhood.\"\nMayor Parker said emergency workers had worked through the night at the crash site.\nOfficials said the wreckage site is large, spanning up to six blocks, and there is also debris in remote areas too.\nThe mayor told city residents that if they find any debris, to call 911 and \"don't touch anything\".\nNTSB investigators are still looking for the cockpit voice recorder - which is \"likely damaged and may be fragmented\", Ms Homendy said.\nShe said investigators would be collecting debris for \"several days, possibly extending into weeks\".\n\"I do want to stress this is an active investigation scene. The debris is scattered, it is very dangerous, so I encourage everyone to stay out of the accident site,\" she said.\nThe FAA is also investigating.\nDid you witness the crash? If it is safe to do so,get in touch.\nIn a statement, President Donald Trump said his administration was \"totally engaged\".\n\"So sad to see the plane go down in Philadelphia, Pennsylvania. More innocent souls lost,\" he said.\nMexican President Claudia Sheinbaum said she \"mourns the passing of six Mexicans in the aviation accident\", in a statement translated from Spanish.\n\"My solidarity is with their loved ones and friends,\" she added.\nThe Mexican foreign ministry said personnel at the country's consulate in Philadelphia were in contact with next-of-kin.\nThis crash comes just two days after amuch larger collision happened between a commercial jet and a military helicopter in Washington DC, where officials believe all 67 people aboard both aircraft were killed.\nIt was the deadliest plane crash in the US in more than 20 years.\nMs Homendy said on Saturday her agency was \"highly skilled\" and it was \"not unusual for the NTSB to be investigating two major accidents\".\nAdditional reporting by Tiffany Wertheimer\nTrump accuses the US's main trading partners of not addressing concerns over illegal drugs and migration - his main election pledges.\nShowrunners say the ceremony will look different as they honour fire victims and first responders.\nEntrepreneurs in the US, Mexico and Canada worry that even a short trade war could push up prices and cost jobs.\nThe Trump administration has asked federal agencies to cull webpages devoted to gender diversity and sexual health.\nAs Justin Trudeau warns Canadians they could face \"difficult days\" ahead, here are four options for retaliation.\nCopyright 2025 BBC. All rights reserved.TheBBCisnot responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "link": "https://apnews.com/article/philadelphia-plane-crash-medical-transport-8617dab53471190832dd73db149489fa",
        "Provider": "Associated Press",
        "headline": "All 6 on medical plane that crashed in Philadelphia were killed | AP News",
        "content": "Copyright 2025 The Associated Press. All Rights Reserved.\nSeven dead, 19 injured in ‘high-impact’ air ambulance crash in Philadelphia\nA small plane crashed in Northeast Philadelphia 30 seconds after it took off as crews respond to a fiery scene, Pennsylvania’s governor said Friday.\nA small plane has crashed in Northeast Philadelphia as crews respond to a fiery scene, Pennsylvania’s governor said Friday. Gov. Josh Shapiro said he is offering all “Commonwealth resources as they respond to the small private plane crash in Northeast Philly.”\nThe scene near Roosevelt Boulevard after a small plane crashed near Roosevelt Mall, Friday, Jan. 31, 2025, in Philadelphia. (Steven M. Falk/The Philadelphia Inquirer via AP)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nFirst responders work the scene after a small plane crashed in Philadelphia, Friday, Jan. 31, 2025. (AP Photo/Matt Rourke)\nFirst responders work the scene after what witnesses say was a plane crash in Philadelphia, Friday, Jan. 31, 2025. (AP Photo/Matt Rourke)\nFirst responders work the scene after a small plane crashed in Philadelphia, Friday, Jan. 31, 2025. (AP Photo/Matt Rourke)\nCrime scene tape surrounds the scene where a small plane crashed in Philadelphia, Friday, Jan. 31, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nAn investigator works the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene where a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene where a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene where a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nAn investigator looks around the roof of a department store near the scene where a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nA member of the NTSB talks to Philadelphia Police officers near the scene where a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nAn Investigator works near the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nFirefighters climb up on the roof near the scene after a small plane crashed in Philadelphia, Saturday, Feb. 1, 2025. (AP Photo/Matt Rourke)\nPHILADELPHIA (AP) — A person in a car was the seventh fatal victim of the fiery crash of an air ambulance onto a busy Philadelphia street, authorities said Saturday, as investigators sifted through burned cars, damaged homes and charred debris for clues to determine why the aircraft plummeted shortly after takeoff.\nCarrying six people from Mexico, including a child who spent months in treatment at a hospital, the Learjet 55 went down just after departing from the Northeast Philadelphia Airport, creating what witnesses described as a massive fireball, shaking houses and leaving a chaotic street scene.\nAuthorities couldn’t yet say why the jet crashed, and Adam Thiel, the city’s managing director, said it could be days — or longer — until officials are able to fully count the number of dead and injured across a sprawling impact area in a densely populated residential area.\nThe plane took off, reached about 1,500 feet of altitude and then plummeted in a steep descent, crashing less than a minute after takeoff in what National Transportation Safety Board chair Jennifer Homendy called a “high-impact crash” that left the plane “highly fragmented.”\nAP correspondent Julie Walker reports on another deadly plane crash, this one a small medical transport that crashed Friday night in Philadelphia.\nAs of Saturday morning, officials said, there were seven dead — six on the jet and the person in the car — and 19 injured. Most of the injured had been treated and released, hospitals said.\nThere are “a lot of unknowns about who was where on the streets” when the plane crashed, and it is possible that the casualty figures will grow, Thiel said.\nThe crash scene was at least four to six blocks, and authorities were working to assess the damage, including going house to house to inspect the dwellings, Thiel said.\nHomendy said her agency’s staff was working to collect debris from the plane, which could take days or weeks, and haul it away to a secure location to begin evaluating it.\nAir traffic controllers didn’t hear anything concerning before the crash, and her agency was still looking for thecockpit voice recorder, a helpful piece of evidence in the investigation, Homendy said.\nIt is likely damaged and possibly fragmented because of the impact, although her agency’s researchers and engineers have significant expertise in repairing them, she said.\nThe plane hit the ground just after 6 p.m., during a busy Friday evening dinner hour less than 3 miles (5 kilometers) from the airport.\n“All of sudden I heard like a ‘boom,’ and I thought it was a thunderstorm,” said Selkuc Koc, a waiter at the Four Seasons Diner on Cottman Avenue. “And I get up and look at the smoke and the fire, it was like a balloon. I thought it was a gas station that blew up.”\nOne diner patron was hit and injured by a small but heavy metal object that flew through the window, Koc said.\nOf the six people on board the medical transport jet, one was a child who had just completed treatment at Shriners Children’s Philadelphia hospital, one was her mother and four were crew members, officials said.\nA hospital spokesperson said the girl spent four months there receiving life-saving treatment for a condition not easily treated in Mexico. Shriners officials said they couldn’t give details about the girl or her family because of patient privacy rules.\n“Her journey was one of hope and of aspiration,” spokesperson Mel Bower told The Philadelphia Inquirer. The relationships that the girl formed with staff “were true and were dear,” and she’ll be missed greatly by them, he said.\nMexican President Claudia Sheinbaum said all six victims on the plane were from her country. In a statement on the social media platform X, she mourned their deaths.\n“Consular authorities are in constant contact with the families; I have asked the Foreign Affairs Secretary to support whatever is needed. My solidarity with their loved ones and friends,” she said in Spanish.\nTijuana, Mexico, across the border from San Diego, was to have been the flight’s final destination after a stop in Missouri.\nNeither Philadelphia officials nor plane owner Jet Rescue Air Ambulance disclosed the identities of the dead.\nBut XE Médica Ambulancias, a Mexican emergency service, identified one of its doctors, Raúl Meza, as a victim. In a post on X, it said he was the service’s chief of neonatology and assigned to a the ISEM Atizapán hospital, which is in the State of Mexico near Mexico City.\nIn Veracruz, a city on the Gulf of Mexico, relatives of Josué Juárez said he was the aircraft’s co-pilot. They were preparing to hold a family ceremony and staying away from TV and social media to avoid seeing images of the crash.\nThey hadn’t seen videos, but they were told that there was a horrible explosion, that the plane broke apart and that the crash scene covered several blocks, brother Édgar Juárez told The Associated Press by phone.\nJosué Juárez, 43, lived in central Mexico, loved salsa dancing and video games and had been a pilot for more than a decade, his brother said. He loved to fly and worked for the air ambulance service for more than a year, flying mostly from Mexico’s Caribbean coast to the United States.\n“He was always aware that he had his risks, but the truth is that more accidents happen on the road,” Édgar Juárez said.\nThe crash came just two days after thedeadliest U.S. air disasterin a generation. On Wednesday night, an American Airlines jet carrying 60 passengers and four crew memberscollided in midairin Washington, D.C., with an Army helicopter carrying three soldiers. There were no survivors.\nHomendy said the NTSB is a highly skilled agency, and that it is not unusual for it to investigate two major accidents at the same time.\nJet Rescue Air Ambulance, which operated the Mexico-registered Learjet 55, is based in that country and has operations both there and in Miami. A company spokesperson said a seasoned crew operated the plane, and all flight crews undergo rigorous training.\nThe Philadelphia crash was the second fatal incident in 15 months for Jet Rescue. In 2023 five crew members were killed when their plane overran a runway in the central Mexican state of Morelos and crashed into a hillside.\nThe Learjet took off from Northeast Philadelphia Airport, which primarily serves business jets and charter flights.\nAudio recorded by LiveATC captured an air traffic controller telling “Medevac Medservice 056” to turn right when departing. About 30 seconds later, the controller repeats the request before asking, “You on frequency?” Minutes later the controller says, “We have a lost aircraft. We’re not exactly sure what happened, so we’re trying to figure it out. For now the field is going to be closed.”\nMichael Schiavone was sitting at his home nearby when he heard a loud bang and the house shook.\n“There was a large explosion, so I thought we were under attack for a second,” he said.\nA doorbell camera captured video of the plane plunging in a streak of white and exploding as it hit the ground.\n“All we heard was a loud roar and didn’t know where it was coming from,” said Jim Quinn, the doorbell’s owner. “We just turned around and saw the big plume.”\nLevy reported from Harrisburg. Associated Press writers Félix Márquez in Mexico City, Hallie Golden, John O’Connor and Cedar Attanasio contributed.\nCopyright 2025 The Associated Press. All Rights Reserved."
    },
    {
        "link": "https://www.nbcnews.com/news/us-news/philadelphia-plane-crash-fire-mall-northeast-rcna190262",
        "Provider": "NBC News",
        "headline": "Philadelphia plane crash: 6 onboard during fiery crash near homes and mall",
        "content": "Profile\nSections\nLocal\ntv\nFeatured\nMore From NBC\nFollow NBC News\nnews Alerts\nThere are no new alerts at this time\nAn air ambulance carrying six people crashed near a mall in northeast Philadelphia on Friday evening, the company that operates the aircraft said.\nJet Rescue Air Ambulance said it could not confirm any survivors among those on board its plane, which included four crew members, a pediatric patient and the patient's escort, according to a statement.\n\"Our immediate concern is for the patient's family, our personnel, their families and other victims that may have been hurt on the ground,\" the company said. A spokesperson said it's unlikely anyone on board survived.\nMayor Cherelle Parker said at a news conference Saturday morning that a person in a car was also killed and 19 people were injured. She said “several dwellings and vehicles were impacted.”\nSix people with injuries attributed to the crash were taken to Temple University Hospital — Jeanes Campus, near Northeast Philadelphia — where three were in fair condition and three others were treated and released, a spokesperson for the institution said.\nIt wasn’t clear where the patients were when the aircraft struck the ground.\nThe Learjet 55 departed from Northeast Philadelphia Airport en route to Springfield-Branson National Airport in Missouri, the Federal Aviation Administration said in a statement.\nOn board were the pilot, a copilot, a physician, a paramedic, the patient, and the escort for the patient, Jet Rescue Air Ambulance said.\nLate Friday night, Mexico's Ministry of Foreign Affairssaid on Xthat all six on board the Learjet were Mexican nationals. It said its consulates were ready to provide support to relatives of those on the plane.\nThe Consulate of Mexico said officials have contacted the families of all six people.\n\"The necessary consular assistance is being provided and working with the authorities to clarify what has happened,\" the Consulate said in a translatedposton Facebook.\nA spokesperson for the company, Shai Gold, toldNBC Philadelphiathe patient was a child who had come to the U.S. for \"life-saving treatment\" and was returning to Mexico.\n\"The treatment ran its course. She was ready to go home, and we were contracted to bring her back home to Mexico,\" Gold said. \"Ultimate destination was the Tijuana International Airport and was scheduled to go home by ground ambulance.\"\nHe said the cost of the flight was covered by an international charity.\nA spokesperson for Shriners Children's Philadelphia hospital said in a statement that the child had been treated at the institution and was traveling with her mother.\n\"Shriners Children’s is heartbroken to confirm that one of our pediatric patients and the child’s mother were aboard the Jet Rescue Air Ambulance that crashed in Philadelphia this evening,\" the spokesperson said.\nThe identities of the people on board have not been publicly released.\nThe plane crashed around 6:30 p.m. near Roosevelt Mall, an outdoor shopping center about 3 miles from the airport, according to officials.\nOdalis Acosta, 29, was helping a customer at Four Seasons Diner when “everything shook.”\n“You heard the explosion. I look to the side and I see through the window the big ball of explosion,” she told NBC News.\nPeople in the restaurant dropped to the ground as the glass around them shattered, she said. One customer was hit in the head by a heavy piece of metal.\nVideo showed smoke and fire in the area of the crash.\n“The FAA and NTSB will investigate,” the FAA said, referring to the National Transportation Safety Board. “The NTSB will lead the investigation and will provide all updates.”\nPennsylvania Gov. Josh Shapiro said on X that he's in touch with Philadelphia officials and will provide updates as he gets them.\n\"We are offering all Commonwealth resources as they respond to the small private plane crash in Northeast Philly,\" he said.\nHome camera video of the crash showed an airborne object descending at an angle in the distance. A fireball is then seen behind some rooflines.\nRev. Todd Sheridan Yeary, a former FAA air traffic controller, said that, having received clearance to take off and the aircraft's good reputation, something likely happened in the moments after its wheels left the ground.\n\"Something happened rather catastrophically after the aircraft lifted off,\" he said on NBC News NOW. \"We don’t know exactly what it is.\"\nHe said the model of the jet is \"high performance.\"\n\"It is very reliable,\" Yeary said. \"It is very unusual to see what we’ve just witnessed.\"\nAir temperature around the time of the crash was 49 degrees, with light rain, some fog, and a wind guest of 30 mph recorded just before 6 p.m., according to National Weather Service data for Philadelphia.\nThe crash comes just days after the deadliest aviation incident in the U.S. in years.\nOn Wednesday,67 people were killed when a passenger plane collided midairwith a Black Hawk military helicopter over the Potomac River near Washington, D.C.\nDennis Romero is a breaking news reporter for NBC News Digital.\nMaya Eaglin is a NY correspondent for NBC News and “Stay Tuned” on Snapchat.\n© 2025 NBCUniversal Media, LLC"
    },
    {
        "link": "https://www.bbc.com/news/articles/ckg0m5n8g0do",
        "Provider": "BBC",
        "headline": "Mother and child among seven killed in Philadelphia medical jet crash",
        "content": "A small medical transport plane crashed into several buildings in the US city of Philadelphia on Friday evening, killing all six people on board and at least one other person on the ground, the mayor has confirmed.\nThe jet was on a medical transport trip, heading to Tijuana, Mexico, with a short stop-over in Missouri. It was carrying a child patient and her mother, along with two pilots, a doctor and paramedic. They were all Mexican nationals.\nBut just one minute after take-off, the Learjet 55 plummeted to the ground. Videos show the plane coming down quickly and sparking a huge fireball.\nNineteen others were injured, though Mayor Cherelle Parker said that number could still change.\nSpeaking at a news conference on Saturday, Philadelphia city managing director Adam Thiel said it would probably be \"days or more\" until officials are able to confirm \"the number of folks who perished in this tragedy and the outcome of those who were injured\".\nHe added that there is still \"a lot of unknowns about who was where\" when the crash happened.\nThe girl being transported to Mexico had just finished medical treatment for a life-threatening illness at Shriners Children's Hospital in Philadelphia.\nEarlier on Friday, staff had thrown her a party to celebrate, hospital spokesman Mel Bower said. He added that staff who treated her had been \"impacted very deeply\" by news of the tragedy.\nThe flight was bound for Springfield, Missouri for a short stop-over, before continuing onto Tijuana.\nThe plane left Northeast Philadelphia Airport at about 18:07 local time (23:07 GMT) on Friday, rose to 1,500ft, turned slightly right, then slightly left, then began a steep descent, National Transportation Safety Board (NTSB) officials said.\nThe crash occurred less than four miles (6.4km) away. Flight logs show the plane was in the air \"for only a minute\" before it crashed, Mayor Parker said.\nNo issues were reported from the plane to air traffic control, and controllers who attempted to get a response from the flight crew did not receive one, NTSB chair Jennifer Homendy said.\nWitnesses described shrapnel damaging cars and sending burning debris into the streets. Photos of the aftermath show mangled, burnt-out vehicles and a deep gouge in the street.\nFire officials said there were five separate fires sparked by the crash, but they were contained and extinguished.\nThe crash happened just blocks from the Roosevelt Mall, a three-storey shopping centre in a densely populated part of Philadelphia, the fifth biggest city in the US.\nThe area is filled with terraced housing and shops. Many properties lost power after the crash.\nOne man said he was driving when he heard a whirring sound and then a loud explosion.\n\"Everyone just started screaming,\" he said.\nAnother witness told local media the explosion \"lit up the whole sky\".\n\"I just saw a plane basically hit the building and it exploded. The sky lit up and I pulled over and basically, it was just real bad around here,\" the witnesstold WPVI-TV, describing the crash as feeling like an earthquake.\nRyan Tian, 23, toldthe Philadelphia Inquirerhe was getting dinner when he saw a \"massive fireball\" that turned the sky orange.\n\"I thought we were getting attacked by something,\" he said.\nIn a statement, Jared Solomon, a local state representative, said: \"In a time of profound tragedy, I was inspired to witness hundreds of our first responders sprinting towards danger to ensure the safety of our neighbourhood.\"\nMayor Parker said emergency workers had worked through the night at the crash site.\nOfficials said the wreckage site is large, spanning up to six blocks, and there is also debris in remote areas too.\nThe mayor told city residents that if they find any debris, to call 911 and \"don't touch anything\".\nNTSB investigators are still looking for the cockpit voice recorder - which is \"likely damaged and may be fragmented\", Ms Homendy said.\nShe said investigators would be collecting debris for \"several days, possibly extending into weeks\".\n\"I do want to stress this is an active investigation scene. The debris is scattered, it is very dangerous, so I encourage everyone to stay out of the accident site,\" she said.\nThe FAA is also investigating.\nDid you witness the crash? If it is safe to do so,get in touch.\nIn a statement, President Donald Trump said his administration was \"totally engaged\".\n\"So sad to see the plane go down in Philadelphia, Pennsylvania. More innocent souls lost,\" he said.\nMexican President Claudia Sheinbaum said she \"mourns the passing of six Mexicans in the aviation accident\", in a statement translated from Spanish.\n\"My solidarity is with their loved ones and friends,\" she added.\nThe Mexican foreign ministry said personnel at the country's consulate in Philadelphia were in contact with next-of-kin.\nThis crash comes just two days after amuch larger collision happened between a commercial jet and a military helicopter in Washington DC, where officials believe all 67 people aboard both aircraft were killed.\nIt was the deadliest plane crash in the US in more than 20 years.\nMs Homendy said on Saturday her agency was \"highly skilled\" and it was \"not unusual for the NTSB to be investigating two major accidents\".\nAdditional reporting by Tiffany Wertheimer\nTrump accuses the US's main trading partners of not addressing concerns over illegal drugs and migration - his main election pledges.\nShowrunners say the ceremony will look different as they honour fire victims and first responders.\nEntrepreneurs in the US, Mexico and Canada worry that even a short trade war could push up prices and cost jobs.\nThe Trump administration has asked federal agencies to cull webpages devoted to gender diversity and sexual health.\nAs Justin Trudeau warns Canadians they could face \"difficult days\" ahead, here are four options for retaliation.\nCopyright 2025 BBC. All rights reserved.TheBBCisnot responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "link": "https://www.foxnews.com/live-news/medevac-flight-transporting-pediatric-patient-crashes-explodes-near-homes-in-philadelphia",
        "Provider": "Fox News",
        "headline": "Philadelphia plane crash: Medical ambulance carrying pediatric patient crashes, explodes near homes | Live Updates from Fox News Digital",
        "content": "This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided byFactset. Powered and implemented byFactSet Digital Solutions.Legal Statement. Mutual Fund and ETF data provided byRefinitiv Lipper.\nA Learjet 55 carrying a young girl who had just undergone life-saving treatment crashed on Friday night in Philadelphia, Pennsylvania. The company operating the flight could not confirm the identities or ages of anyone onboard until family is notified, but said it is unlikely there are survivors.\nCovered by:Rachel Wolf,Chris PandolfoandAlexandra Koch\nA medical ambulance plane transporting a young girl who had just received life-saving treatment crashed on a street Friday night near the Roosevelt Mall in Philadelphia, Pennsylvania.\nJet Rescue Air Ambulance, the global ambulance flight company operating the plane, said it's Learjet 55 crashed while departing from Northeast Philadelphia Airport at about 6:30 p.m.\nThe company said there were four crew members and two passengers on the plane at the time – a pilot, copilot, physician, paramedic, pediatric patient and her mother. They were all Mexican nationals.\nFast, 24/7 alerts delivered to your inbox daily. Subscribe to be in the know of the most important moments around the world.\nBy subscribing, you agree to our Privacy Policy.\nincoming update…\nCoverage for this event has ended.\nTransportation Secretary Sean Duffy speaks during a news conference at Ronald Reagan Washington National Airport, Thursday, in Arlington, Va. (AP Photo/Mark Schiefelbein)\nFollowing the tragic Philadelphia and D.C. plane crashes this week, Secretary of Transportation Sean Duffy on Saturday announced the department will no longer be participating in identity-based celebrations.\nDuffy posted a statement on X saying that as of 8 p.m. Saturday, the Department of Transportation will no longer participate in celebrations \"based on immutable traits or any other identity-based observances.\"\n\"In the wake of two devastating plane crashes, my focus is singular: enforcing the highest standards of safety and accountability,\" Duffy wrote in the post.\n\"These distractions do nothing to keep planes in the air, trains on the tracks, or ports and highways secure,\" he wrote. \"... From now on, everyday of every month we celebrate transportation, beautiful infrastructure, and safety.\"\nThe National Transportation Safety Board (NTSB) during a news conference on Saturday reassured the public it is able to investigate the Philadelphia medevac crash and the D.C. plane crash concurrently.\nNTSB Chairman Jennifer Homendy said she was sure she would get questions about having two major accident investigations at one time.\n“We are a highly skilled agency,” Homendy said. “It is not unusual for the NTSB to be investigating two major accidents. We have tremendous resources at both and we will get to our findings, our probable cause, our recommendations, and to a final investigative report.”\nEarlier Saturday, Duffy said he spoke with Gov. Josh Shapiro and would provide “whatever resources he needs.”\nLisa Deeley, vice chair of the Philadelphia Commission, posted to X saying she has “no words” for the devastation in her community, following the tragic medevac plane crash Friday night.\n“The last 21 hours have been just a surge of emotions,” Deeley wrote in the post. “A tragic plane crash occurred half a mile from the home where I grew up, lived in for over 50 years, and where I am still an active member of the community.”\nDeeley said there are no words to express how troubling the videos and images coming out of her neighborhood have been.\n“An office building where I worked for 10 years appears to have been damaged,” she wrote. “I saw debris in the parking lot of the mall where I hung out as a teenager. I can say that you see these things on TV, but it is totally different when it is in your own backyard.”\nOn Saturday morning, Deeley offered her condolences to Consul General Carlos Obrador, for the loss of his country's citizens.\nShe said she continues to pray for the victims on the ground, and thanked local officials for their efforts.\n“Please stay in your homes and avoid the site of the accident,” she Deeley wrote. “Please be patient, as there will be disruptions for a while, but the city, state, and federal governments are all working together to respond and investigate this tragedy.”\nInvestigators work the scene after a small plane crashed in Philadelphia, Saturday. (AP Photo/Matt Rourke)\nWhile city officials have only confirmed 19 injuries resulting from the medevac crash Friday night in Philadelphia, local hospitals have released statements indicating the number is likely higher.\nJefferson Health on Saturday confirmed it provided care for 15 victims.\nOf those treated, 12 were discharged and two have been admitted, according to Jefferson Health. One patient was transferred to another hospital.\nFox News Digital previously reported that six victims were treated and released from Temple Health Saturday morning.\nThe National Transportation Safety Board (NTSB), which is investigating the devastating medevac plane crash in Philadelphia Friday night, announced it is searching for the aircraft’s black box — still missing among a scattered debris field.\nDuring a news conference Saturday afternoon, the NTSB said the flight originated in Opa-Locka, Florida, and arrived at Northeast Philadelphia Airport at about 2:15 p.m.\nThe plane remained on the ground for a few hours before departing runway two after sunset, at about 6:06 p.m., and climbed to about 1,500 feet.\n“We were looking at GPS data on the aircraft,” said NTSB Chairman Jennifer Homendy. “[The plane made] a slight right turn, followed by a slight left turn, and then a steep descent toward the ground, where it crashed. The flight lasted less than a minute.”\nHomendy noted the right and left turns right before the crash “[don’t] really suggest anything right now.”\nThe crash is still classified as an accident.\nCrews have found the two engines and are searching for the cockpit voice recorder, which might provide more information.\nHowever, the debris field extends four to five blocks and could take days to weeks to collect, according to the NTSB. Once picked up, crews will move debris to a secure location for evaluation.\nThe NTSB said it is likely the black box is very damaged.\n“I want to stress this was a high impact crash, and the plane is highly fragmented,” Homendy said. “[The black box] could be intact, but likely it is very damaged. It may be fragmented.”\nNTSB investigators arrived at the scene within 90 minutes of the crash, and a full “Go Team” was deployed Saturday morning — with a total of 17 people with specific expertise in areas of aviation safety.\nAnyone who finds debris, even if it is not recognizable, should email the NTSB at witness@ntsb.gov. Videos can also be sent to the same address to aid investigators.\nAn official with Jet Rescue Air Ambulance recently confirmed the medevac plane did a “nosedive” before crashing into a Philadelphia street, killing seven and injuring 19 Friday night.\nShai Gold, Air Ambulance managing director, described the incident as “unusual,” ABC 6 news reported.\n“It's a very unusual situation, where immediately after takeoff, the plane [did a] nosedive,” Gold said Saturday. “Very unusual.”\nWhile the company said it does not yet know the cause of the crash, it noted the airplane’s maintenance records were “impeccable” and it goes “by the book.”\n“I don't want to speculate,” Gold said. “The NTSB (National Transportation Safety Board) will come and investigate everything and we’ll just have to sit patiently and wait for them.”\nThe company said it will cooperate fully with the investigating agency.\nThe Ministry of Foreign Affairs of Mexico announced it has been in contact with the families of those killed in the medevac plane crash in Philadelphia.\nIn a post on X, the Ministry of Foreign Affairs of Mexico said it was directed by Mexico President Claudia Sheinbaum Pardo to make contact through the Mexican Consulate in Philadelphia.\n“There has been excellent coordination and collaboration with the ground teams of Pennsylvania Gov. Josh Shapiro, Philadelphia Mayor Cherelle L. Parker, the City of Philadelphia Office of Emergency Management, and other institutions involved in the research efforts,” according to the post.\nThe ministry of foreign affairs said it “reiterates its solidarity and condolences to the families of the victims.”\nOfficials with Jet Rescue Air Ambulance, the company that owned the medevac plane, said they have been in contact with the consulate.\nInvestigators work the scene where a small plane crashed in Philadelphia, Saturday. (AP Photo/Matt Rourke)\nRed Cross Philadelphia on Saturday confirmed four people were displaced after a medevac plane carrying a child, her mother, and four crew members crashed on a street near Roosevelt Mall Friday night.\nSeven people are dead, and at least 19 were injured, as of Saturday afternoon.\nThe leakage of jet fuel from the wreck caused a number of nearby homes and cars to catch fire.\nIn a post on X, Red Cross Philadelphia confirmed a number of people were displaced following the subsequent infernos.\n“In partnership with [City of Philadelphia Office of Emergency Management], Red Cross volunteers opened a shelter at Fels HS where four people spent Friday night,” according to the post.\nWhile acknowledging the outpouring of support from the community, the organization noted no donations should be brought to the shelter.\n“We understand people want to help and appreciate the support,” officials wrote. “Right now, the Red Cross has what it needs to support the community. We ask that you not bring material donations such as clothing or food to the shelter. We're working to identify partners to handle donations.”\nPennsylvania Gov. Josh Shapiro and Philadelphia Mayor Cherelle Parker hold news conference Saturday after assessing the site a day after a medevac plane operated by Jet Rescue Air Ambulance crashed soon after takeoff in Philadelphia. (Reuters/Bastiaan Slabbers)\nPhiladelphia Fire Commissioner Jeffrey Thompson said the fire department completelyextinguished five firesthat broke out after a medical jet crashed near Roosevelt Mall in Philadelphia.\nFire marshals remain on the scene and are investigating those dwellings looking for anyone who may be injured or in need of rescue.\n\"This is a very large area with a lot of damage, and we are still working in a number of different ways to assess that damage,\" said Adam Thiel, managing director for the City of Philadelphia. \"Right now, we are doing another, what we call a grid search of this entire roughly 4 to 6 block area, a very dense area to ensure that we have found everything that we need to find, that we have checked it, as you heard the mayor say, with all of the residents and we will continue to do that. We have teams who are going literally house by house, door to door and also our licensing inspections. personnel are inspecting all of those dwellings.\"\nThiel added it is \"entirely possible\" that the casualty numbers may increase as the investigation continues.\n\"We have a lot of unknowns about who was where on the streets of this neighborhood last night at the time of impact, so it will likely be days or more until we are able to definitively answer the question about the number of folks who perished in this tragedy and the outcome for those who are injured.\"\nPhiladelphia Mayor Cherelle Parker speaks during a news conference following a plane crash in Philadelphia, Friday. (AP Photo/Matt Rourke)\nPhiladelphia Mayor Cherelle Parker urged all Americans to pray for Philadelphia in the aftermath of the tragic plane crash which claimed seven lives.\n\"I happened to be a praying mayor and I know that prayer works. And if you...the most powerful thing that you can do if your home right now, if you're anywhere across the nation or in the Commonwealth or the city and you're saying, what can I do to help? Offer a prayer for our city, now is the time that we need it,\" Parker said at a news conference on Saturday.\nThe mayor also said the city will make \"formal, actionable\" means available for people to assist, but she stressed that no donations are needed at this time.\nParker also warned people not to fall forfundraising scams, saying \"nothing has been established on social media\" to raise money for the city or for the victims of the plane crash.\n\"We ask you to proceed with caution. I would stay away from it if I were you,\" she said.\nPhiladelphia Mayor Cherelle Parkerconfirmed Saturday that six individuals on board a medical ambulance jet that crashed at Roosevelt Mall all perished.\nAdditionally, at least one more person who was in a car died when the plane crashed.\nThe mayor also confirmed that at least 19 individuals were injured, but that number \"is not etched in stone.\"\n\"The investigation is ongoing. Investigators are pouring over the crash site right now further updates will be provided as soon as they are available. But I want to be clear that we will find a cause for this tragedy,\" Parker said.\nUtility companies are working to restore service interruption caused by the plane crash, the mayor added.\n\"We are encouraging as many people as possible in the area to stay home if you can, because this is an active investigation. However, I do want to note that we have, members of our police and fire and Office of Emergency Management on all of our blocks. No Philadelphian who is in the impacted area should have a problem moving to and from their home if necessary and they have to leave.\"\nTransportation Secretary Sean Duffysaid he's received an update from the National Transportation Safety Board investigation into the Philadelphia plane crash on Saturday morning.\n\"I reiterated that they will have the full support of @USDOT as they seek answers. I will continue to share updates as I receive them,\" Duffy posted on X.\nNTSB has deployed investigators to the crash site in Philadelphia after a Learjet 55 airplane carrying four crew members and two passengers, a pediatric patient and their caregiver, crashed in a fiery explosion. All aboard were Mexican nationals and none survived.\nRoosevelt Mall, where the plane crashed, remains closed at the request of authorities, the Philadelphia Inquirer reported.\nKristen Moore, a spokesperson for the Mall said there has not yet been a full property assessment, \"but it did not seem like there was significant damage.\"\nShe said there were no injuries on the mall's property. Even so, it will remain closed until further notice.\n\"It's horrible,\" Moore told the Inquirer. \"I feel terrible for the victims and families.\"\nSix patients who were injured when a medical ambulance plane crashed in Northeast Philadelphia on Friday were treated and released Saturday morning, a spokesman for Temple Health said.\nThree of the patients treated at Temple University Hospital – Jeanes Campus were in fair condition. All have been treated and released at this campus.\nThere remains one patient at Temple University Hospital – Main Campus in fair condition, the spokesperson said.\nOfficials have not yet confirmed the total number of people injured when the private medical jet crashed in the area ofRoosevelt MallFriday.\nJet Rescue Air Ambulance, a medical flight company, said in a statement that four crew members and two passengers, a pediatric patient and their mother, were on the plane. All six were Mexican nationals and they all died in the crash, Mexican President Claudia Sheinbaum said.\nShriners Children's Hospital in Philadelphia said it was \"heartbroken\" to confirm that one of its patients was aboard the doomed flight.\nAn aerial view of theplane crash site in Philadelphiashows a large debris field and workers investigating the wreckage.\nWitnesses described a massive fireball where a Learjet 55 operated by Jet Rescue Air Ambulance crashed while departing from Northeast Philadelphia Airport at around 6:30 p.m. on Friday.\nThere were four crew members and two passengers – a pediatric patient and the child's mother – on the plane when it went down. All wereMexican nationals, officials said.\nAir Ambulance spokesperson Shai Gold told Fox News Digital the patient was a Mexican national who was in the U.S. for life-saving medical treatment. At the end of treatment, she was released to go home.\nThe plane was scheduled to fly from Philadelphia to Tijuana International Airport, with one technical stop in Springfield, Missouri for fuel, according to Gold.\nThe FAA confirmed the plane was on its way to Missouri at the time of the crash.\nFox News Digital's Alexandra Koch, Lorraine Taylor, Alexis McAdams, and CB Cotton contributed to this update.\nMEXICO CITY, MEXICO - JANUARY 29, 2025: Claudia Sheinbaum, President of Mexico talks about energy issues during a briefing conference at National Palace. on January 29, 2025 in Mexico City, Mexico. (Photo credit should read Carlos Santiago/ Pixelnews/Future Publishing via Getty Images)\nMexican President Claudia Sheinbaumconfirmed the deaths of six of the country's nationals in the medical transportation jet crash that happened in Northeast Philadelphia on Friday.\n\"I regret the death of six Mexicans in the plane crash in Philadelphia, United States,\" Sheinbaum wrote on X.\nThe president said the Mexican consulate is in permanent contact with the families of those deceased.\n\"My solidarity with their loved ones and friends,\" she wrote.\nSheinbaum said she has instructed the Ministry of Foreign Affairs to support the families \"in whatever way is required.\"\nThe Ministry of Foreign Affairs spoke out about the tragedy earlier.\n\"@ConsulmexFila personnel are in contact with relatives and will provide all the required consular support and assistance, and will be on the lookout in case there are more compatriots affected in the vicinity of the accident,\" the ministry said.\nIn a briefing Friday night, Mayor Cherelle L. Parker said there was not yet an official count of how many people were injured or killed when the medical jet crashed in a fiery explosion.\nA medical transport jet headed for Missouri and carrying a child patient and five others crashed inNortheast PhiladelphiaFriday night.\nThe jet was part of the Jet Rescue Air Ambulance, which provides global ambulance flight services.\nIt's the same service that once helped transport Boston Red Sox legend and MLB Hall of Famer David Ortiz with a critical injury after he was shot in his home country of the Dominican Republic June 9, 2019, at a bar in Santo Domingo.\nOrtiz was severely wounded but survived emergency surgery.\nA portion of Ortiz's intestines, colon and gallbladder were removed, and he also reportedly had liver damage. The next day, a Jet Rescue plane transported Ortiz to Boston, where he received further treatment at Massachusetts General Hospital, including a second surgery.\nOrtiz was moved out of the intensive care unit on June 22, 2019, and he was released from the hospital over a month later on July 26, 2019.\nThe suspected shooter was later identified as Rolfi Ferreira-Cruz, but an investigation also found Ortiz was not the intended target. The Dominican Attorney General announced June 19, 2019, Ortiz was shot by mistake, and Sixto David Fernandez was identified as the intended target of the shooting.\nThePhiladelphia Eagleswill have plenty more to play for when they take the field in Super Bowl LIX next Sunday against the Kansas City Chiefs.\nAfter an air ambulance carrying six people crashed in Northern Philadelphia Friday night, causing a massive explosion that has killed an unconfirmed number of people, the Eagles released a statement expressing condolences for its impacted Philadelphia residents and the victims on board the flight.\n\"The Eagles organization was heartbroken to learn of the tragic loss of life earlier this evening as a result of the plane crash in Northeast Philadelphia,\" the team said. \"We extend our condolences to the victims and loved ones they leave behind. We are grateful to the first responders for their heroic actions at the scene.\"\nJet Rescue Air Ambulance, the global ambulance flight company operating the plane, said its Learjet 55 crashed while departing from Northeast Philadelphia Airport at about 6:30 p.m.\nThe plane was scheduled to fly from Philadelphia to Tijuana International Airport, with one technical stop in Springfield, Missouri for fuel, Air Ambulance spokesperson Shai Gold told Fox News Digital.\nA senior Philadelphia fire official told Fox News the fires that were sparked by the crash are \"now under control.\"\nShriners Children's Philadelphiareleased a statement Friday confirming that a young patient and the child's mother were aboard the Jet Rescue Air Ambulance that crashed in Philadelphia.\n\"The patient had received care from Shriners Children's Philadelphia and was being transported back to her home country in Mexico on a contracted air ambulance when the crash happened,\" the statement read. \"Because of patient privacy concerns, we cannot say any more about the patient and her family at this time.\n\"Our hearts and prayers go out to the families of the medical crew and pilots who were also lost in this tragic event – as well as all of the people who were affected on the ground – and we're thankful to the first responders for their quick action.\"\nEveryone aboard the flight was from Mexico. The child was being transported home, according to Jet Rescue spokesperson Shai Gold. The flight’s final destination was Tijuana after a stop in Missouri.\nThe patient and her mother were on board along with four crew members. Gold said this was a seasoned crew and everyone involved in these flights goes through rigorous training.\nThe Associated Press contributed to this update.\nVideo shared by witnesses shows the moments after a Learjet 55 medical ambulance plane crashed near the Roosevelt Mall inPhiladelphia, Penn.\n\"You just hear everybody say, 'get down! Get down! Get Down!' And when everybody said, get down, we all get down. But I just see the plane is getting lower and lower,\" one witness told Fox News.\nHe described hearing a large boom when the plane crashed into the plaza, sending debris and jet fuel scattering everywhere.\n\"I never seen nothing like that a day in my life. I have never seen nothing like that,\" the witness said.\nAuthorities have urged people to stay away from the crash site, where highly flammable jet fuel sprayed onto nearby row homes, which went up in flames.\n\"It was a big ball of fire,\" another witness told Fox News. \"Just flew into the sky. And the whole gas station started shaking.\"\nAudio from an air traffic control tower atNortheast Philadelphia Airportreveals the horrific moments before a medical ambulance plane crashed in Philadelphia Friday night while transporting a pediatric patient.\nThe audio, obtained by Fox News Digital, was recorded moments before the plane took off. Operators can be heard speaking as they desperately tried to make contact with the Learjet 55 before it crashed.\n\"What’s going on down there?\" one air traffic controller can be heard saying.\n\"We have a lost aircraft. We’re not exactly sure what happened. So, we’re trying to figure it out,\" replies another air traffic controller. \"The field is going to be closed so no inbounds-outbounds.\"\nJet Rescue Air Ambulance, the company operating the plane, said the aircraft was a Learjet 55 while departing from the Northeast Philadelphia Airport around 6:30 p.m.\nThe company said there were four crew members and two passengers on the plane at the time – a pilot, copilot, physician, paramedic, pediatric patient and her mother. They were all Mexican nationals.\nThe Federal Aviation Administration confirmed there were six people on the plane. The agency said the plane was heading to Springfield-Branson National Airport in Missouri.\nAir Ambulance spokesperson Shai Gold told Fox News Digital the patient was a Mexican national who was in the U.S. for life-saving medical treatment. At the end of treatment, she was released to go home.\nSmoke rises as emergency personnel operate at the site of a plane crash in Philadelphia, Friday.\nThe company operating the medical ambulance jet that crashed on Friday night inPhiladelphia, Pennsylvania, while transporting a pediatric patient was operating another aircraft in a fatal crash that happened more than a year ago.\nOn Friday, Jet Rescue Air Ambulance, the company operating the planes in both incidents, said a Learjet 55 crashed while departing from Northeast Philadelphia Airport around 6:30 p.m. The incident happened on a street near Roosevelt Mall.\nFour crew members and two passengers – a pediatric patient and her mother – were on the plane in the Philadelphia crash that was headed to Springfield-Branson National Airport in Missouri, the company said. They were all Mexican nationals.\nThe Federal Aviation Administration confirmed the number of crew members and passengers. The crew members included a pilot, a copilot, a physician and a paramedic.\nJet Rescue Air Ambulance operated a Learjet 35A in November 2023 that was involved in a deadly crash in southern Mexico.\nIn that incident, the aircraft crashed on landing at Cuernavaca Airport in Morelos, Mexico, on Nov. 1, 2023, after departing from Toluca International Airport in the city of Toluca. There were five crewmembers with no passengers on board and no survivors, the AirMed&Rescue website reported at the time.\nJet Rescue Air Ambulance said no names in the Philadelphia crash on Friday will be released until family members have been notified.\n\"Our immediate concern is for the patient's family, our personnel, their families and other victims that may have been hurt on the ground,\" the company said in a statement.\nPhiladelphia Mayor Cherelle Parkerat a press conference Friday night said she was unable to confirm the number of fatalities and asked for prayers.\n\"We know there will be loss in this region,\" Parker said.\nEarlier, she advised locals not to touch anything and call 911 if they come across debris.\nA medical oxygen tank donning the name of the transport company was seen on the ground outside a McDonald's near the scene of the crash. A police commander told FOX 29's Steve Keeley that there were \"pieces everywhere.\"\nThe City of Philadelphia posted on X, calling the incident \"major.\"\n\"Major incident near Cottman and Bustleton Avenues in Northeast Philadelphia across from Roosevelt Mall,\" according to the post. \"Roads closed in area including parts of Roosevelt Boulevard. Avoid area.\"\nCity officials confirmed 45 state troopers are on the ground assisting.\nA video shows the plane loudly crashing in the distance, with a burst of light covering the area.\nA seniorPhiladelphia fire officialtells Fox News the fires that were sparked by the crash are \"now under control.\"\nThe official said when the plane went down, it sprayed jet fuel, soaking nearby row homes. The homes then went up in flames. The fire official tells Fox News six houses and six cars caught on fire.\nPresident Donald Trump took to Truth Social to react to the tragedy.\n\"So sad to see the plane go down in Philadelphia, Pennsylvania. More innocent souls lost. Our people are totally engaged,\" Trump wrote. \"First Responders are already being given credit for doing a great job. More to follow. God Bless you all.\"\nVice President JD Vance later took to X, calling the situation \"very sad.\"\n\"May God bless the victims and their families,\" Vance wrote.\nU.S. Department of Transportation Secretary Sean Duffy posted on X that he briefed Trump and other officials on the disaster.\n\"Just briefed the President and @GovernorShapiro from FAA HQ. I offered the full support of the @USDOT to the Governor and local officials,\" Duffy wrote. \"Investigators are on site.\"\nA medical ambulance plane transporting a young girl who had just received life-saving treatment crashed on a street Friday night near the Roosevelt Mall inPhiladelphia, Pennsylvania.\nJet Rescue Air Ambulance, the global ambulance flight company operating the plane, said it's Learjet 55 crashed while departing from Northeast Philadelphia Airport at about 6:30 p.m.\nThe company said there were four crew members and two passengers on the plane at the time – a pilot, copilot, physician, paramedic, pediatric patient and her mother. They were all Mexican nationals.\nThe Federal Aviation Administration confirmed the number of crew members and passengers.\nAir Ambulance spokesperson Shai Gold told Fox News Digital the patient was a Mexican national who was in the U.S. for life-saving medical treatment. At the end of treatment, she was released to go home.\nThe plane was scheduled to fly from Philadelphia to Tijuana International Airport, with one technical stop in Springfield, Missouri for fuel, according to Gold.\nThe FAA confirmed the plane was on its way to Missouri at the time of the crash.\nThe company could not confirm the identities or ages of anyone onboard until family is notified, but said it is unlikely there are survivors.\n\"The plane was loaded with jet fuel that's highly flammable,\" Gold said. \"There is no indication that anybody survived, and by the debris field, I would be pleasantly surprised to learn otherwise.\"\nLive Coverage begins here\nThis material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX News Network, LLC. All rights reserved. Quotes displayed in real-time or delayed by at least 15 minutes. Market data provided byFactset. Powered and implemented byFactSet Digital Solutions.Legal Statement. Mutual Fund and ETF data provided byRefinitiv Lipper."
    }
]